---
kind: other
id: Methods.T:Autodesk.Revit.DB.LayoutRuleFixedDistance
source: html/ae442a07-1ff2-d6c5-8fa2-3294221f1290.htm
---
# LayoutRuleFixedDistance Methods

Causes the object to release immediately any resources it may be utilizing.